import 'package:places/domain/sight.dart';

final List<Sight> mocks = [
  Sight(
    name: 'Долина гейзеров',
    lat: 54.438383,
    lon: 160.135913,
    url: 'https://rocketsoft.pro/img-places/img-1.jpg',
    details:
        'Долина гейзеров — одно из крупнейших гейзерных полей мира, объект Всемирного наследия ЮНЕСКО. Самая известная и при этом самая труднодоступная достопримечательность Камчатки. Чтобы попасть сюда, придется лететь на вертолете, а до поездки получить специальное разрешение, количество которых ограничено. Именно поэтому большинство туристов, ездивших на Камчатку, видели эту уникальную долину только на фото. Ну или в фильме «Земля Санникова», который снимали как раз в этих краях.',
    type: 'Тур',
  ),
  Sight(
    name: 'Халактырский пляж',
    lat: 52.989528,
    lon: 158.842972,
    url: 'https://rocketsoft.pro/img-places/img-2.jpg',
    details:
        'Халактырский пляж на берегу Тихого океана недалеко от Петропавловска-Камчатского восхищает и завораживает суровой красотой. Берег покрыт чёрным песком вулканического происхождения. На 30-километровой береговой линии не бывает много народа. Купаться в океане отважится не каждый — вода обычно не нагревается выше 15°C. Сюда приезжают с палатками на несколько дней, чтобы полюбоваться камчатскими вулканами и лазурными водами океана, полежать на прогретом песке, который, как утверждают местные жители. обладает целебными свойствами.',
    type: 'Тур',
  ),
  Sight(
    name: 'Вулкан Мутновский',
    lat: 52.453,
    lon: 158.195,
    url: 'https://rocketsoft.pro/img-places/img-4.jpg',
    details:
        'Вулкан Мутновский легко узнаваем в камчатском пейзаже по стоящему над ним столбу пара. Это самый активный вулкан полуострова. Сопка имеет четыре кратера и одно ущелье с красноречивым названием Овраг опасный. Путь к вершине длиной 35 км проходит мимо Дачных источников, которые называют Долиной гейзеров в миниатюре. Второй маршрут более короткий, но менее доступный, проходящий вдоль отвесных обрывов с камнепадами.',
    type: 'Тур',
  ),
  Sight(
    name: 'Мёртвый лес',
    lat: 55.645578,
    lon: 160.257557,
    url: 'https://rocketsoft.pro/img-places/img-5.jpg',
    details:
        'Мёртвый лес называют печальным чудом природы. В 1975 году после извержения вулкана Плоский Толбачик большая часть тайги была сожжена лавой и засыпана пеплом. Остались только большие и толстые деревья, но они почернели и со временем засохли. За 1,5 года, что длилось извержение, пострадало 45 кв. км леса. Пейзаж стал похож на лунный, долгое время Мёртвый лес был закрытой зоной — здесь проводились испытания советских луноходов.',
    type: 'Тур',
  ),
  Sight(
    name: 'Курильское озеро',
    lat: 51.458333,
    lon: 157.105833,
    url: 'https://rocketsoft.pro/img-places/img-3.jpg',
    details:
    'Курильское озеро — второй по величине пресный водоём Камчатского края. Его площадь — 77 кв. км, максимальная глубина — 306 метров. С двух сторон берега «подпирают» вулкан Ильинский и Камбальная сопка. Да и само Курильское образовалось в жерле потухшего вулкана.',
    type: 'Тур',
  ),
];
